mediaMicroservices/wrk2/outs/c50_r2000.out
Running 1m test @ http://10.100.189.154:8080/wrk2-api/review/compose
  4 threads and 50 connections
  Thread calibration: mean lat.: 10000.384ms, rate sampling interval: 20021ms
  Thread calibration: mean lat.: 10006.528ms, rate sampling interval: 20021ms
  Thread calibration: mean lat.: 9998.336ms, rate sampling interval: 20004ms
  Thread calibration: mean lat.: 9998.336ms, rate sampling interval: 20004ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    45.70s     5.23s    0.87m    82.07%
    Req/Sec    25.50     24.51    51.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   46.01s 
 75.000%   49.38s 
 90.000%    0.85m 
 99.000%    0.87m 
 99.900%    0.88m 
 99.990%    0.88m 
 99.999%    0.88m 
100.000%    0.88m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10002.431     0.000000           20         1.00
   41091.071     0.100000          654         1.11
   42401.791     0.200000         1285         1.25
   43614.207     0.300000         1920         1.43
   44793.855     0.400000         2567         1.67
   46006.271     0.500000         3201         2.00
   46661.631     0.550000         3535         2.22
   47316.991     0.600000         3851         2.50
   48037.887     0.650000         4164         2.86
   48758.783     0.700000         4482         3.33
   49381.375     0.750000         4801         4.00
   49709.055     0.775000         4963         4.44
   50069.503     0.800000         5121         5.00
   50429.951     0.825000         5279         5.71
   50724.863     0.850000         5441         6.67
   50987.007     0.875000         5606         8.00
   51085.311     0.887500         5684         8.89
   51216.383     0.900000         5785        10.00
   51314.687     0.912500         5859        11.43
   51412.991     0.925000         5939        13.33
   51511.295     0.937500         6011        16.00
   51544.063     0.943750         6038        17.78
   51609.599     0.950000         6099        20.00
   51675.135     0.956250         6139        22.86
   51707.903     0.962500         6160        26.67
   51773.439     0.968750         6208        32.00
   51806.207     0.971875         6220        35.56
   51838.975     0.975000         6240        40.00
   51871.743     0.978125         6259        45.71
   51937.279     0.981250         6288        53.33
   52002.815     0.984375         6312        64.00
   52002.815     0.985938         6312        71.11
   52035.583     0.987500         6330        80.00
   52035.583     0.989062         6330        91.43
   52068.351     0.990625         6338       106.67
   52133.887     0.992188         6353       128.00
   52133.887     0.992969         6353       142.22
   52166.655     0.993750         6361       160.00
   52199.423     0.994531         6364       182.86
   52232.191     0.995313         6372       213.33
   52264.959     0.996094         6375       256.00
   52264.959     0.996484         6375       284.44
   52297.727     0.996875         6378       320.00
   52330.495     0.997266         6380       365.71
   52363.263     0.997656         6383       426.67
   52396.031     0.998047         6386       512.00
   52396.031     0.998242         6386       568.89
   52494.335     0.998437         6389       640.00
   52494.335     0.998633         6389       731.43
   52527.103     0.998828         6390       853.33
   52559.871     0.999023         6391      1024.00
   52592.639     0.999121         6392      1137.78
   52625.407     0.999219         6394      1280.00
   52625.407     0.999316         6394      1462.86
   52625.407     0.999414         6394      1706.67
   52625.407     0.999512         6394      2048.00
   52658.175     0.999561         6395      2275.56
   52658.175     0.999609         6395      2560.00
   52658.175     0.999658         6395      2925.71
   52756.479     0.999707         6396      3413.33
   52756.479     0.999756         6396      4096.00
   52756.479     0.999780         6396      4551.11
   52756.479     0.999805         6396      5120.00
   52756.479     0.999829         6396      5851.43
   52822.015     0.999854         6397      6826.67
   52822.015     1.000000         6397          inf
#[Mean    =    45702.947, StdDeviation   =     5226.693]
#[Max     =    52789.248, Total count    =         6397]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6406 requests in 1.00m, 1.29MB read
  Non-2xx or 3xx responses: 1011
Requests/sec:    106.74
Transfer/sec:     22.02KB