mediaMicroservices/wrk2/outs/c50_r250.out
Running 1m test @ http://10.100.189.154:8080/wrk2-api/review/compose
  4 threads and 50 connections
  Thread calibration: mean lat.: 20.207ms, rate sampling interval: 72ms
  Thread calibration: mean lat.: 19.876ms, rate sampling interval: 72ms
  Thread calibration: mean lat.: 19.774ms, rate sampling interval: 74ms
  Thread calibration: mean lat.: 19.780ms, rate sampling interval: 71ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    71.86ms  711.08ms 171.01ms   99.50%
    Req/Sec    47.58     37.11   138.00     63.14%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.05ms
 75.000%   23.79ms
 90.000%   37.79ms
 99.000%  171.01ms
 99.900%   10.01s 
 99.990%   10.40s 
 99.999%   10.40s 
100.000%   10.40s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.711     0.000000            1         1.00
       7.615     0.100000          952         1.11
       9.127     0.200000         1906         1.25
      10.831     0.300000         2854         1.43
      12.743     0.400000         3806         1.67
      15.047     0.500000         4757         2.00
      16.239     0.550000         5232         2.22
      17.775     0.600000         5707         2.50
      19.343     0.650000         6184         2.86
      21.215     0.700000         6662         3.33
      23.791     0.750000         7134         4.00
      25.055     0.775000         7375         4.44
      26.687     0.800000         7611         5.00
      28.831     0.825000         7848         5.71
      31.167     0.850000         8085         6.67
      33.983     0.875000         8323         8.00
      35.679     0.887500         8442         8.89
      37.791     0.900000         8560        10.00
      40.223     0.912500         8679        11.43
      43.007     0.925000         8798        13.33
      47.167     0.937500         8917        16.00
      49.919     0.943750         8977        17.78
      53.215     0.950000         9037        20.00
      56.415     0.956250         9096        22.86
      61.791     0.962500         9155        26.67
      68.863     0.968750         9215        32.00
      72.639     0.971875         9244        35.56
      77.055     0.975000         9274        40.00
      84.991     0.978125         9303        45.71
      95.551     0.981250         9333        53.33
     111.615     0.984375         9363        64.00
     121.535     0.985938         9378        71.11
     133.247     0.987500         9393        80.00
     151.807     0.989062         9407        91.43
     218.239     0.990625         9422       106.67
     281.343     0.992188         9437       128.00
     335.359     0.992969         9445       142.22
     381.695     0.993750         9452       160.00
     504.063     0.994531         9459       182.86
   10002.431     0.995313         9495       213.33
   10002.431     0.996094         9495       256.00
   10002.431     0.996484         9495       284.44
   10002.431     0.996875         9495       320.00
   10002.431     0.997266         9495       365.71
   10002.431     0.997656         9495       426.67
   10002.431     0.998047         9495       512.00
   10002.431     0.998242         9495       568.89
   10010.623     0.998437         9502       640.00
   10010.623     0.998633         9502       731.43
   10010.623     0.998828         9502       853.33
   10010.623     0.999023         9502      1024.00
   10133.503     0.999121         9503      1137.78
   10158.079     0.999219         9504      1280.00
   10182.655     0.999316         9505      1462.86
   10248.191     0.999414         9507      1706.67
   10248.191     0.999512         9507      2048.00
   10248.191     0.999561         9507      2275.56
   10256.383     0.999609         9508      2560.00
   10256.383     0.999658         9508      2925.71
   10289.151     0.999707         9509      3413.33
   10289.151     0.999756         9509      4096.00
   10289.151     0.999780         9509      4551.11
   10395.647     0.999805         9511      5120.00
   10395.647     1.000000         9511          inf
#[Mean    =       71.859, StdDeviation   =      711.077]
#[Max     =    10387.456, Total count    =         9511]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  12015 requests in 1.00m, 2.16MB read
  Non-2xx or 3xx responses: 314
Requests/sec:    200.19
Transfer/sec:     36.85KB