mediaMicroservices/wrk2/outs/c50_r500.out
Running 1m test @ http://10.100.189.154:8080/wrk2-api/review/compose
  4 threads and 50 connections
  Thread calibration: mean lat.: 9998.336ms, rate sampling interval: 20004ms
  Thread calibration: mean lat.: 9998.336ms, rate sampling interval: 20004ms
  Thread calibration: mean lat.: 9998.336ms, rate sampling interval: 20004ms
[...]
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    30.35s    14.03s   50.53s    61.02%
    Req/Sec     1.00      0.00     1.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   30.00s 
 75.000%   40.17s 
 90.000%   50.00s 
 99.000%   50.53s 
 99.900%   50.69s 
 99.990%   50.69s 
 99.999%   50.69s 
100.000%   50.69s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10002.431     0.000000           39         1.00
   10002.431     0.100000           39         1.11
   19841.023     0.200000           48         1.25
   20004.863     0.300000           72         1.43
   29753.343     0.400000           96         1.67
   29999.103     0.500000          119         2.00
   30113.791     0.550000          130         2.22
   39747.583     0.600000          143         2.50
   39911.423     0.650000          154         2.86
   40009.727     0.700000          166         3.33
   40173.567     0.750000          177         4.00
   40271.871     0.775000          183         4.44
   49250.303     0.800000          189         5.00
   49774.591     0.825000          195         5.71
   49840.127     0.850000          201         6.67
   49938.431     0.875000          208         8.00
   49971.199     0.887500          210         8.89
   50003.967     0.900000          213        10.00
   50069.503     0.912500          217        11.43
   50102.271     0.925000          221        13.33
   50135.039     0.937500          223        16.00
   50135.039     0.943750          223        17.78
   50233.343     0.950000          226        20.00
   50233.343     0.956250          226        22.86
   50266.111     0.962500          228        26.67
   50331.647     0.968750          230        32.00
   50331.647     0.971875          230        35.56
   50397.183     0.975000          231        40.00
   50397.183     0.978125          231        45.71
   50429.951     0.981250          232        53.33
   50528.255     0.984375          234        64.00
   50528.255     0.985938          234        71.11
   50528.255     0.987500          234        80.00
   50528.255     0.989062          234        91.43
   50528.255     0.990625          234       106.67
   50626.559     0.992188          235       128.00
   50626.559     0.992969          235       142.22
   50626.559     0.993750          235       160.00
   50626.559     0.994531          235       182.86
   50626.559     0.995313          235       213.33
   50692.095     0.996094          236       256.00
   50692.095     1.000000          236          inf
#[Mean    =    30347.924, StdDeviation   =    14025.300]
#[Max     =    50659.328, Total count    =          236]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  240 requests in 1.00m, 83.67KB read
  Non-2xx or 3xx responses: 240
Requests/sec:      4.00
Transfer/sec:      1.39KB